zlgopen/ametal/soc/mm32/mm32l373/mm32l373_pin.h
#define PIOA_1_TIM2_CH2_REMAP0       AM_MM32L373_GPIO_REMAP_CODE(0x08, 0)   /**< \brief TIM2_CH2 */
#define PIOA_1_TIM2_CH2_REMAP2       AM_MM32L373_GPIO_REMAP_CODE(0x08, 2)   /**< \brief TIM2_CH2 */

/** @} */

/**
 * \name PIOA_1引脚复用时功能模式
 * @{
 */

#define PIOA_1_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_1_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_1_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_1_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_1_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_1_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_1_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_1_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_1引脚响应速率
 * @{
 */

#define PIOA_1_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOA_1_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOA_1_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_2引脚复用功能
 * @{
 */
#define PIOA_2_NO_REMAP              AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOA_2_UART2_TX              PIOA_2_NO_REMAP   /**< \brief UART2_TX */
#define PIOA_2_ADC1_IN2              PIOA_2_NO_REMAP   /**< \brief ADC1_IN2 */
#define PIOA_2_GPIO                  PIOA_2_NO_REMAP   /**< \brief GPIO */

#define PIOA_2_TIM2_CH3_REMAP0       AM_MM32L373_GPIO_REMAP_CODE(0x08, 0)   /**< \brief TIM2_CH3 */
#define PIOA_2_TIM2_CH3_REMAP1       AM_MM32L373_GPIO_REMAP_CODE(0x08, 1)   /**< \brief TIM2_CH3 */
/** @} */

/**
 * \name PIOA_2引脚复用时功能模式
 * @{
 */

#define PIOA_2_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_2_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_2_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_2_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_2_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_2_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_2_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_2_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_2引脚响应速率
 * @{
 */

#define PIOA_2_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOA_2_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOA_2_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_3引脚复用功能
 * @{
 */
#define PIOA_3_NO_REMAP              AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOA_3_ADC1_IN3              PIOA_3_NO_REMAP   /**< \brief ADC1_IN3 */
#define PIOA_3_UART2_RX              PIOA_3_NO_REMAP   /**< \brief UART2_RX */
#define PIOA_3_GPIO                  PIOA_3_NO_REMAP   /**< \brief GPIO */

#define PIOA_3_TIM2_CH4_REMAP0       AM_MM32L373_GPIO_REMAP_CODE(0x08, 0)   /**< \brief TIM2_CH4 */
#define PIOA_3_TIM2_CH4_REMAP1       AM_MM32L373_GPIO_REMAP_CODE(0x08, 1)   /**< \brief TIM2_CH4 */

/** @} */

/**
 * \name PIOA_3引脚复用时功能模式
 * @{
 */

#define PIOA_3_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_3_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_3_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_3_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_3_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_3_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_3_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_3_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_3引脚响应速率
 * @{
 */

#define PIOA_3_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOA_3_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOA_3_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_4引脚复用功能
 * @{
 */
#define PIOA_4_NO_REMAP              AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOA_4_ADC1_IN4              PIOA_4_NO_REMAP    /**< \brief ADC1_IN4 */
#define PIOA_4_DAC1_OUT              PIOA_4_NO_REMAP    /**< \brief DAC1_OUT */
#define PIOA_4_GPIO                  PIOA_4_NO_REMAP    /**< \brief GPIO */
#define PIOA_4_SPI1_NSS              PIOA_4_NO_REMAP    /**< \brief SPI1_NSS */

/** @} */

/**
 * \name PIOA_4引脚复用时功能模式
 * @{
 */

#define PIOA_4_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_4_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_4_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_4_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_4_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_4_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_4_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_4_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_4引脚响应速率
 * @{
 */

#define PIOA_4_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOA_4_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOA_4_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_5引脚复用功能
 * @{
 */
#define PIOA_5_NO_REMAP              AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOA_5_ADC1_IN5              PIOA_5_NO_REMAP   /**< \brief ADC1_IN5 */
#define PIOA_5_DAC2_OUT              PIOA_5_NO_REMAP   /**< \brief DAC2_OUT */
#define PIOA_5_GPIO                  PIOA_5_NO_REMAP   /**< \brief GPIO */

