zlgopen/ametal/soc/mm32/mm32l373/mm32l373_pin.h
#define PIOA_5_SPI1_SCK_REMAP0       AM_MM32L373_GPIO_REMAP_CODE(0x00, 0)   /**< \brief SPI1_SCK */

/** @} */

/**
 * \name PIOA_5引脚复用时功能模式
 * @{
 */

#define PIOA_5_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_5_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_5_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_5_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_5_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_5_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_5_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_5_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_5引脚响应速率
 * @{
 */

#define PIOA_5_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOA_5_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOA_5_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_6引脚复用功能
 * @{
 */
#define PIOA_6_NO_REMAP              AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOA_6_ADC1_IN6              PIOA_6_NO_REMAP   /**< \brief ADC1_IN6 */
#define PIOA_6_GPIO                  PIOA_6_NO_REMAP   /**< \brief GPIO */

#define PIOA_6_SPI1_MISO_REMAP0      AM_MM32L373_GPIO_REMAP_CODE(0x00, 0)   /**< \brief SPI1_MISO */
#define PIOA_6_TIM3_CH1_REMAP0       AM_MM32L373_GPIO_REMAP_CODE(0x0A, 0)   /**< \brief TIM3_CH3 */
#define PIOA_6_TIM1_BAKIN_REMAP1      AM_MM32L373_GPIO_REMAP_CODE(0x06, 1)   /**< \brief TIM1_BAKIN */

/** @} */

/**
 * \name PIOA_6引脚复用时功能模式
 * @{
 */

#define PIOA_6_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_6_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_6_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_6_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_6_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_6_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_6_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_6_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_6引脚响应速率
 * @{
 */

#define PIOA_6_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOA_6_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOA_6_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_7引脚复用功能
 * @{
 */
#define PIOA_7_NO_REMAP              AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOA_7_ADC1_IN7              PIOA_7_NO_REMAP   /**< \brief ADC1_IN7 */
#define PIOA_7_GPIO                  PIOA_7_NO_REMAP   /**< \brief GPIO */

#define PIOA_7_SPI1_MOSI_REMAP0      AM_MM32L373_GPIO_REMAP_CODE(0x00, 0)   /**< \brief SPI1_MOSI */
#define PIOA_7_TIM3_CH2_REMAP0       AM_MM32L373_GPIO_REMAP_CODE(0x0A, 0)   /**< \brief TIM3_CH2 */
#define PIOA_7_TIM1_CH1N_REMAP1      AM_MM32L373_GPIO_REMAP_CODE(0x06, 1)   /**< \brief TIM1_CH1N */
/** @} */

/**
 * \name PIOA_7引脚复用时功能模式
 * @{
 */

#define PIOA_7_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_7_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_7_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_7_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_7_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_7_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_7_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_7_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_7引脚响应速率
 * @{
 */

#define PIOA_7_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOA_7_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOA_7_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_8引脚复用功能
 * @{
 */
#define PIOA_8_NO_REMAP              AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOA_8_MCO                   PIOA_8_NO_REMAP   /**< \brief MCO */
#define PIOA_8_GPIO                  PIOA_8_NO_REMAP   /**< \brief GPIO */

#define PIOA_8_TIM1_CH1_REMAP0       AM_MM32L373_GPIO_REMAP_CODE(0x06, 0)   /**< \brief TIM1_CH1 */
#define PIOA_8_TIM1_CH1_REMAP1       AM_MM32L373_GPIO_REMAP_CODE(0x06, 1)   /**< \brief TIM1_CH1 */

/** @} */

/**
 * \name PIOA_8引脚复用时功能模式
 * @{
 */

#define PIOA_8_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_8_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_8_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_8_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_8_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_8_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_8_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_8_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_8引脚响应速率
 * @{
 */

#define PIOA_8_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOA_8_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOA_8_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_9引脚复用功能
 * @{
 */
#define PIOA_9_NO_REMAP              AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOA_9_GPIO                  PIOA_9_NO_REMAP   /**< \brief GPIO */

#define PIOA_9_UART1_TX_REMAP0       AM_MM32L373_GPIO_REMAP_CODE(0x02, 0)   /**< \brief UART1_TX */
#define PIOA_9_TIM1_CH2_REMAP0       AM_MM32L373_GPIO_REMAP_CODE(0x06, 0)   /**< \brief TIM1_CH2 */
#define PIOA_9_TIM1_CH2_REMAP1       AM_MM32L373_GPIO_REMAP_CODE(0x06, 1)   /**< \brief TIM1_CH2 */

/** @} */

/**
 * \name PIOA_9引脚复用时功能模式
 * @{
 */

#define PIOA_9_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_9_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_9_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_9_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_9_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_9_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_9_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_9_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_9引脚响应速率
 * @{
 */

#define PIOA_9_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOA_9_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOA_9_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_10引脚复用功能
 * @{
 */
#define PIOA_10_NO_REMAP             AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOA_10_GPIO                 PIOA_10_NO_REMAP   /**< \brief GPIO */

#define PIOA_10_UART1_RX_REMAP0      AM_MM32L373_GPIO_REMAP_CODE(0x02, 0)   /**< \brief UART1_RX */
#define PIOA_10_TIM1_CH3_REMAP0      AM_MM32L373_GPIO_REMAP_CODE(0x06, 0)   /**< \brief TIM1_CH3 */
#define PIOA_10_TIM1_CH3_REMAP1      AM_MM32L373_GPIO_REMAP_CODE(0x06, 1)   /**< \brief TIM1_CH3 */
/** @} */

/**
 * \name PIOA_10引脚复用时功能模式
 * @{
 */

#define PIOA_10_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_10_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_10_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_10_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_10_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_10_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_10_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_10_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_10引脚响应速率
 * @{
 */

#define PIOA_10_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOA_10_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOA_10_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_11引脚复用功能
 * @{
 */
#define PIOA_11_NO_REMAP             AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOA_11_UART1_CTS            PIOA_11_NO_REMAP   /**< \brief UART1_CTS */
#define PIOA_11_USBDM                PIOA_11_NO_REMAP   /**< \brief USBDM */
#define PIOA_11_GPIO                 PIOA_11_NO_REMAP   /**< \brief GPIO */

#define PIOA_11_TIM1_CH4_REMAP0      AM_MM32L373_GPIO_REMAP_CODE(0X06, 0)  /**< \brief TIM1_CH4 */
#define PIOA_11_TIM1_CH4_REMAP1      AM_MM32L373_GPIO_REMAP_CODE(0X06, 1)  /**< \brief TIM1_CH4 */
#define PIOA_11_CAN_RX_REMAP0        AM_MM32L373_GPIO_REMAP_CODE(0X0D, 0)  /**< \brief CAN_RX */
/** @} */

/**
 * \name PIOA_11引脚复用时功能模式
 * @{
 */

#define PIOA_11_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_11_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_11_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_11_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_11_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_11_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_11_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_11_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_11引脚响应速率
 * @{
 */

