zlgopen/ametal/soc/mm32/mm32l373/mm32l373_pin.h
#define PIOA_11_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOA_11_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOA_11_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_12引脚复用功能
 * @{
 */
#define PIOA_12_NO_REMAP              AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOA_12_UART1_RTS             PIOA_12_NO_REMAP   /**< \brief UART1_RTS */
#define PIOA_12_USBDP                 PIOA_12_NO_REMAP
#define PIOA_12_GPIO                  PIOA_12_NO_REMAP   /**< \brief GPIO */

#define PIOA_12_CAN_TX_REMAP0         AM_MM32L373_GPIO_REMAP_CODE(0x0D, 0)   /**< \brief CAN_TX */
#define PIOA_12_TIM1_ETR_REMAP0       AM_MM32L373_GPIO_REMAP_CODE(0x06, 0)   /**< \brief TIM1_ETR */
#define PIOA_12_TIM1_ETR_REMAP1       AM_MM32L373_GPIO_REMAP_CODE(0x06, 1)   /**< \brief TIM1_ETR */

/** @} */

/**
 * \name PIOA_12引脚复用时功能模式
 * @{
 */

#define PIOA_12_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_12_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_12_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_12_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_12_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_12_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_12_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_12_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_12引脚响应速率
 * @{
 */

#define PIOA_12_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOA_12_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOA_12_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_13引脚复用功能
 * @{
 */
#define PIOA_13_NO_REMAP              AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOA_13_GPIO                  PIOA_13_NO_REMAP   /**< \brief GPIO */

#define PIOA_13_SWDIO                 AM_MM32L373_GPIO_REMAP_CODE(0x10, 0)   /**< \brief SWDIO */

/** @} */

/**
 * \name PIOA_13引脚复用时功能模式
 * @{
 */

#define PIOA_13_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_13_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_13_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_13_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_13_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_13_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_13_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_13_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_13引脚响应速率
 * @{
 */

#define PIOA_13_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOA_13_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOA_13_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_14引脚复用功能
 * @{
 */
#define PIOA_14_NO_REMAP              AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOA_14_GPIO                  PIOA_14_NO_REMAP   /**< \brief GPIO */

#define PIOA_14_SWDCLK                AM_MM32L373_GPIO_REMAP_CODE(0x10, 0)   /**< \brief SWDCLK */

/** @} */

/**
 * \name PIOA_14引脚复用时功能模式
 * @{
 */

#define PIOA_14_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_14_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_14_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_14_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_14_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_14_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_14_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_14_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_14引脚响应速率
 * @{
 */

#define PIOA_14_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOA_14_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOA_14_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_15引脚复用功能
 * @{
 */
#define PIOA_15_NO_REMAP              AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOA_15_SPI1_NSS              PIOA_15_NO_REMAP   /**< \brief SPI1_NSS */
#define PIOA_15_GPIO                  PIOA_15_NO_REMAP   /**< \brief GPIO */

#define PIOA_15_TIM2_CH1_ETR_REMAP1   AM_MM32L373_GPIO_REMAP_CODE(0x08, 1)   /**< \brief TIM2_CH1_ETR */
#define PIOA_15_TIM2_CH1_ETR_REMAP3   AM_MM32L373_GPIO_REMAP_CODE(0x08, 3)   /**< \brief TIM2_CH1_ETR */
#define PIOA_15_JTDI                  AM_MM32L373_GPIO_REMAP_CODE(0x10, 0)   /**< \brief JTDI */

/** @} */

/**
 * \name PIOA_15引脚复用时功能模式
 * @{
 */

#define PIOA_15_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_15_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_15_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_15_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_15_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_15_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_15_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_15_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_15引脚响应速率
 * @{
 */

