zlgopen/ametal/soc/mm32/mm32l373/mm32l373_pin.h
#define PIOA_15_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOA_15_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOA_15_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_0引脚复用功能
 * @{
 */
#define PIOB_0_NO_REMAP               AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOB_0_ADC2_IN0               PIOB_0_NO_REMAP   /**< \brief ADC2_IN0 */
#define PIOB_0_GPIO                   PIOB_0_NO_REMAP   /**< \brief GPIO */

#define PIOB_0_TIM3_CH3_REMAP0        AM_MM32L373_GPIO_REMAP_CODE(0x0A, 0)   /**< \brief TIM3_CH3 */
#define PIOB_0_TIM3_CH3_REMAP2        AM_MM32L373_GPIO_REMAP_CODE(0x0A, 2)   /**< \brief TIM3_CH3 */
#define PIOB_0_TIM1_CH2N_REMAP1       AM_MM32L373_GPIO_REMAP_CODE(0X06, 1)   /**< \brief TIM1_CH2N */
/** @} */

/**
 * \name PIOB_8引脚复用时功能模式
 * @{
 */

#define PIOB_0_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_0_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOB_0_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_0_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_0_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_0_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_0_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_0_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_0引脚响应速率
 * @{
 */

#define PIOB_0_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOB_0_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOB_0_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_1引脚复用功能
 * @{
 */
#define PIOB_1_NO_REMAP              AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOB_1_ADC2_IN1              PIOB_1_NO_REMAP   /**< \brief ADC2_IN1 */
#define PIOB_1_GPIO                  PIOB_1_NO_REMAP   /**< \brief GPIO */

#define PIOB_1_TIM3_CH4_REMAP0       AM_MM32L373_GPIO_REMAP_CODE(0x0A, 0)   /**< \brief TIM3_CH4 */
#define PIOB_1_TIM3_CH4_REMAP1       AM_MM32L373_GPIO_REMAP_CODE(0x0A, 1)   /**< \brief TIM3_CH4 */
#define PIOB_1_TIM1_CH3N_REMAP1      AM_MM32L373_GPIO_REMAP_CODE(0x06, 1)   /**< \brief TIM1_CH3N */

/** @} */

/**
 * \name PIOB_1引脚复用时功能模式
 * @{
 */

#define PIOB_1_AIN                  AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_1_INPUT_FLOAT          AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOB_1_INPUT_PD             AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_1_INPUT_PU             AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_1_OUT_PP               AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_1_OUT_OD               AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_1_AF_PP                AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_1_AF_OD                AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_1引脚响应速率
 * @{
 */

#define PIOB_1_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOB_1_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOB_1_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_2引脚复用功能
 * @{
 */
#define PIOB_2_NO_REMAP              AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOB_2_GPIO                  PIOB_2_NO_REMAP   /**< \brief GPIO */

/** @} */

/**
 * \name PIOB_2引脚复用时功能模式
 * @{
 */

#define PIOB_2_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_2_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOB_2_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_2_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_2_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_2_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_2_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_2_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_2引脚响应速率
 * @{
 */

#define PIOB_2_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOB_2_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOB_2_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_3引脚复用功能
 * @{
 */
#define PIOB_3_NO_REMAP              AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOB_3_GPIO                  PIOB_3_NO_REMAP   /**< \brief GPIO */

#define PIOB_3_TRACESWO              AM_MM32L373_GPIO_REMAP_CODE(0x10, 0)   /**< \brief TRACESWO */
#define PIOB_3_TIM2_CH2_REMAP1       AM_MM32L373_GPIO_REMAP_CODE(0x08, 1)   /**< \brief TIM2_CH2 */
#define PIOB_3_TIM2_CH2_REMAP3       AM_MM32L373_GPIO_REMAP_CODE(0x08, 3)   /**< \brief TIM2_CH2 */
#define PIOB_3_SPI1_SCK_REMAP1       AM_MM32L373_GPIO_REMAP_CODE(0x00, 1)   /**< \brief SPI1_SCK */

/** @} */

/**
 * \name PIOB_3引脚复用时功能模式
 * @{
 */

