zlgopen/ametal/soc/mm32/mm32l373/mm32l373_pin.h
#define PIOB_3_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_3_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOB_3_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_3_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_3_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_3_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_3_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_3_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_3引脚响应速率
 * @{
 */

#define PIOB_3_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOB_3_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOB_3_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_4引脚复用功能
 * @{
 */
#define PIOB_4_NO_REMAP              AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOB_4_GPIO                  PIOB_4_NO_REMAP   /**< \brief GPIO */

#define PIOB_4_TIM3_CH1_REMAP2       AM_MM32L373_GPIO_REMAP_CODE(0x0A, 2)   /**< \brief TIM3_CH1 */
#define PIOB_4_SPI1_MISO_REMAP1      AM_MM32L373_GPIO_REMAP_CODE(0x00, 1)   /**< \brief SPI1_MISO */
#define PIOB_4_JNTRST                AM_MM32L373_GPIO_REMAP_CODE(0x10, 0)   /**< \brief JNTRST */
/** @} */

/**
 * \name PIOB_4引脚复用时功能模式
 * @{
 */

#define PIOB_4_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_4_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOB_4_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_4_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_4_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_4_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_4_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_4_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_4引脚响应速率
 * @{
 */

#define PIOB_4_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOB_4_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOB_4_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_5引脚复用功能
 * @{
 */

#define PIOB_5_NO_REMAP              AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOB_5_GPIO                  PIOB_5_NO_REMAP   /**< \brief GPIO */
#define PIOB_5_I2C1_SMBAI            PIOB_5_NO_REMAP   /**< \brief I2C1_SMBAI */

#define PIOB_5_TIM3_CH2_REMAP2       AM_MM32L373_GPIO_REMAP_CODE(0x0A, 2)   /**< \brief TIM3_CH2 */
#define PIOB_5_SPI1_MOSI_REMAP1      AM_MM32L373_GPIO_REMAP_CODE(0x00, 1)   /**< \brief SPI1_MOSI */

/** @} */

/**
 * \name PIOB_5引脚复用时功能模式
 * @{
 */

#define PIOB_5_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_5_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOB_5_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_5_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_5_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_5_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_5_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_5_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_5引脚响应速率
 * @{
 */

#define PIOB_5_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOB_5_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOB_5_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_6引脚复用功能
 * @{
 */

#define PIOB_6_NO_REMAP              AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOB_6_GPIO                  PIOB_6_NO_REMAP   /**< \brief GPIO */
#define PIOB_6_TIM4_CH1              PIOB_6_NO_REMAP   /**< \brief TIM4_CH1 */

#define PIOB_6_I2C1_SCL_REMAP0       AM_MM32L373_GPIO_REMAP_CODE(0x01, 0)   /**< \brief I2C1_SCL */
#define PIOB_6_UART1_TX_REMAP1       AM_MM32L373_GPIO_REMAP_CODE(0x02, 1)   /**< \brief UART1_TX */

/** @} */

/**
 * \name PIOB_6引脚复用时功能模式
 * @{
 */

#define PIOB_6_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_6_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOB_6_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_6_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_6_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_6_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_6_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_6_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_6引脚响应速率
 * @{
 */

