zlgopen/ametal/soc/mm32/mm32l373/mm32l373_pin.h
#define PIOB_6_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOB_6_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOB_6_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_7引脚复用功能
 * @{
 */

#define PIOB_7_NO_REMAP              AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOB_7_TIM4_CH2              PIOB_7_NO_REMAP   /**< \brief TIM4_CH2 */
#define PIOB_7_GPIO                  PIOB_7_NO_REMAP   /**< \brief GPIO */

#define PIOB_7_I2C1_SDA_REMAP0       AM_MM32L373_GPIO_REMAP_CODE(0x01, 0)   /**< \brief I2C1_SDA */
#define PIOB_7_UART1_RX_REMAP1       AM_MM32L373_GPIO_REMAP_CODE(0x02, 1)   /**< \brief UART1_RX */

/** @} */

/**
 * \name PIOB_7管脚复用时引脚复用时功能模式
 * @{
 */

#define PIOB_7_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_7_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOB_7_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_7_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_7_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_7_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_7_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_7_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_7引脚响应速率
 * @{
 */

#define PIOB_7_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOB_7_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOB_7_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_8引脚复用功能
 * @{
 */

#define PIOB_8_NO_REMAP              AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOB_8_TIM4_CH3              PIOB_8_NO_REMAP   /**< \brief TIM4_CH3 */
#define PIOB_8_GPIO                  PIOB_8_NO_REMAP   /**< \brief GPIO */

#define PIOB_8_I2C1_SCL_REMAP1       AM_MM32L373_GPIO_REMAP_CODE(0x01, 1)   /**< \brief I2C1_SCL */
#define PIOB_8_CAN_RX_REMAP2         AM_MM32L373_GPIO_REMAP_CODE(0x0D, 2)   /**< \brief CAN_RX */

/** @} */

/**
 * \name PIOB_8引脚复用时功能模式
 * @{
 */

#define PIOB_8_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_8_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOB_8_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_8_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_8_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_8_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_8_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_8_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_8引脚响应速率
 * @{
 */

#define PIOB_8_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOB_8_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOB_8_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_9引脚复用功能
 * @{
 */

#define PIOB_9_NO_REMAP              AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOB_9_TIM4_CH4              PIOB_9_NO_REMAP   /**< \brief TIM4_CH4 */
#define PIOB_9_GPIO                  PIOB_9_NO_REMAP   /**< \brief GPIO */

#define PIOB_9_I2C1_SDA_REMAP1       AM_MM32L373_GPIO_REMAP_CODE(0x01, 1)   /**< \brief I2C1_SDA */
#define PIOB_9_CAN_TX_REMAP2         AM_MM32L373_GPIO_REMAP_CODE(0x0D, 2)   /**< \brief CAN_TX */

/** @} */

/**
 * \name PIOB_9引脚复用时功能模式
 * @{
 */

#define PIOB_9_AIN                   AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_9_INPUT_FLOAT           AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOB_9_INPUT_PD              AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_9_INPUT_PU              AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_9_OUT_PP                AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_9_OUT_OD                AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_9_AF_PP                 AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_9_AF_OD                 AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_9引脚响应速率
 * @{
 */

#define PIOB_9_SPEED_10MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOB_9_SPEED_2MHz            AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOB_9_SPEED_50MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_10引脚复用功能
 * @{
 */

#define PIOB_10_NO_REMAP             AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOB_10_I2C2_SCL             PIOB_10_NO_REMAP   /**< \brief I2C2_SCL */
#define PIOB_10_GPIO                 PIOB_10_NO_REMAP   /**< \brief GPIO */

#define PIOB_10_UART3_TX_REMAP0      AM_MM32L373_GPIO_REMAP_CODE(0x04, 0)   /**< \brief UART3_TX */
#define PIOB_10_TIM2_CH3_REMAP2      AM_MM32L373_GPIO_REMAP_CODE(0x08, 2)   /**< \brief TIM2_CH3 */
#define PIOB_10_TIM2_CH3_REMAP3      AM_MM32L373_GPIO_REMAP_CODE(0x08, 3)   /**< \brief TIM2_CH3 */

/** @} */

/**
 * \name PIOB_10引脚复用时功能模式
 * @{
 */

