zlgopen/ametal/soc/mm32/mm32l373/mm32l373_pin.h
#define PIOB_10_AIN                  AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_10_INPUT_FLOAT          AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOB_10_INPUT_PD             AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_10_INPUT_PU             AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_10_OUT_PP               AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_10_OUT_OD               AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_10_AF_PP                AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_10_AF_OD                AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_10引脚响应速率
 * @{
 */

#define PIOB_10_SPEED_10MHz          AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOB_10_SPEED_2MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOB_10_SPEED_50MHz          AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_11引脚复用功能
 * @{
 */

#define PIOB_11_NO_REMAP             AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOB_11_I2C2_SDA             PIOB_11_NO_REMAP   /**< \brief I2C2_SDA */
#define PIOB_11_GPIO                 PIOB_11_NO_REMAP   /**< \brief GPIO */

#define PIOB_11_UART3_RX_REMAP0      AM_MM32L373_GPIO_REMAP_CODE(0x04, 0)   /**< \brief UART3_RX */
#define PIOB_11_TIM2_CH4_REMAP2      AM_MM32L373_GPIO_REMAP_CODE(0x08, 2)   /**< \brief TIM2_CH4 */
#define PIOB_11_TIM2_CH4_REMAP3      AM_MM32L373_GPIO_REMAP_CODE(0x08, 3)   /**< \brief TIM2_CH4 */

/** @} */

/**
 * \name PIOB_11引脚复用时功能模式
 * @{
 */

#define PIOB_11_AIN                  AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_11_INPUT_FLOAT          AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOB_11_INPUT_PD             AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_11_INPUT_PU             AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_11_OUT_PP               AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_11_OUT_OD               AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_11_AF_PP                AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_11_AF_OD                AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_11引脚响应速率
 * @{
 */

#define PIOB_11_SPEED_10MHz          AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOB_11_SPEED_2MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOB_11_SPEED_50MHz          AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_12引脚复用功能
 * @{
 */

#define PIOB_12_NO_REMAP             AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOB_12_SPI2_NSS             PIOB_12_NO_REMAP   /**< \brief SPI2_NSS */
#define PIOB_12_I2C2_SMBAI           PIOB_12_NO_REMAP   /**< \brief I2C2_SMBAI */
#define PIOB_12_GPIO                 PIOB_12_NO_REMAP   /**< \brief GPIO */

#define PIOB_12_TIM1_BAKIN_REMAP0     AM_MM32L373_GPIO_REMAP_CODE(0x06, 0)   /**< \brief TIM1_BAKIN */

/** @} */

/**
 * \name PIOB_12引脚复用时功能模式
 * @{
 */

#define PIOB_12_AIN                  AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_12_INPUT_FLOAT          AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOB_12_INPUT_PD             AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_12_INPUT_PU             AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_12_OUT_PP               AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_12_OUT_OD               AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_12_AF_PP                AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_12_AF_OD                AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_12引脚响应速率
 *
 * @{
 */

#define PIOB_12_SPEED_10MHz          AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOB_12_SPEED_2MHz           AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOB_12_SPEED_50MHz          AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_13引脚复用功能
 * @{
 */

#define PIOB_13_NO_REMAP            AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOB_13_SPI2_SCK            PIOB_13_NO_REMAP   /**< \brief SPI2_SCK */
#define PIOB_13_UART3_CTS           PIOB_13_NO_REMAP   /**< \brief UART3_CTS */
#define PIOB_13_GPIO                PIOB_13_NO_REMAP   /**< \brief GPIO */

#define PIOB_13_TIM1_CH1N_REMAP0    AM_MM32L373_GPIO_REMAP_CODE(0x06, 0)   /**< \brief TIM1_CH1N */

/** @} */

/**
 * \name PIOB_13引脚复用时功能模式
 * @{
 */

#define PIOB_13_AIN                 AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_13_INPUT_FLOAT         AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOB_13_INPUT_PD            AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_13_INPUT_PU            AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_13_OUT_PP              AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_13_OUT_OD              AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_13_AF_PP               AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_13_AF_OD               AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_13引脚响应速率
 * @{
 */

#define PIOB_13_SPEED_10MHz         AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOB_13_SPEED_2MHz          AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOB_13_SPEED_50MHz         AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_14引脚复用功能
 * @{
 */

#define PIOB_14_NO_REMAP           AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOB_14_SPI2_MISO          PIOB_14_NO_REMAP   /**< \brief SPI2_MISO */
#define PIOB_14_UART3_RTS          PIOB_14_NO_REMAP   /**< \brief UART3_RTS */
#define PIOB_14_GPIO               PIOB_14_NO_REMAP   /**< \brief GPIO */

#define PIOB_14_TIM1_CH2N_REMAP0   AM_MM32L373_GPIO_REMAP_CODE(0x06, 0)   /**< \brief TIM1_CH2N */

/** @} */

/**
 * \name PIOB_14引脚复用时功能模式
 * @{
 */

#define PIOB_14_AIN                AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_14_INPUT_FLOAT        AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOB_14_INPUT_PD           AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_14_INPUT_PU           AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_14_OUT_PP             AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_14_OUT_OD             AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_14_AF_PP              AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_14_AF_OD              AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_14引脚响应速率
 * @{
 */

#define PIOB_14_SPEED_10MHz        AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOB_14_SPEED_2MHz         AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOB_14_SPEED_50MHz        AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_15引脚复用功能
 * @{
 */

#define PIOB_15_NO_REMAP           AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOB_15_SPI2_MOSI          PIOB_15_NO_REMAP   /**< \brief SPI2_MOSI */
#define PIOB_15_GPIO               PIOB_15_NO_REMAP   /**< \brief GPIO */

