zlgopen/ametal/soc/mm32/mm32l373/mm32l373_pin.h
#define PIOC_15_SPEED_10MHz     AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOC_15_SPEED_2MHz      AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOC_15_SPEED_50MHz     AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOD_0引脚复用功能
 * @{
 */

#define PIOD_0_NO_REMAP         AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOD_0_OSC_IN           PIOD_0_NO_REMAP   /**< \brief OSC_IN */
#define PIOD_0_GPIO             PIOD_0_NO_REMAP    /**< \brief GPIO */

/** @} */

/**
 * \name PIOD_0引脚复用时功能模式
 * @{
 */

#define PIOD_0_AIN              AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOD_0_INPUT_FLOAT      AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOD_0_INPUT_PD         AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOD_0_INPUT_PU         AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOD_0_OUT_PP           AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOD_0_OUT_OD           AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOD_0_AF_PP            AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOD_0_AF_OD            AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOD_0引脚响应速率
 * @{
 */

#define PIOD_0_SPEED_10MHz      AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOD_0_SPEED_2MHz       AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOD_0_SPEED_50MHz      AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOD_1引脚复用功能
 * @{
 */

#define PIOD_1_NO_REMAP         AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOD_1_OSC_OUT          PIOD_1_NO_REMAP   /**< \brief OSC_OUT */
#define PIOD_1_GPIO             PIOD_1_NO_REMAP   /**< \brief GPIO */

/** @} */

/**
 * \name PIOD_1引脚复用时功能模式
 * @{
 */

#define PIOD_1_AIN              AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOD_1_INPUT_FLOAT      AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOD_1_INPUT_PD         AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOD_1_INPUT_PU         AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOD_1_OUT_PP           AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOD_1_OUT_OD           AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOD_1_AF_PP            AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOD_1_AF_OD            AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOD_1引脚响应速率
 * @{
 */

#define PIOD_1_SPEED_10MHz      AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOD_1_SPEED_2MHz       AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOD_1_SPEED_50MHz      AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOD_2引脚复用功能
 * @{
 */

#define PIOD_2_NO_REMAP         AM_MM32L373_GPIO_REMAP_CODE(0x11, 0)
#define PIOD_2_GPIO             PIOD_2_NO_REMAP   /**< \brief GPIO */
#define PIOD_2_TIM3_ETR         PIOD_2_NO_REMAP   /**< \brief TIM3_ETR */

/** @} */

/**
 * \name PIOD_2引脚复用时功能模式
 * @{
 */

#define PIOD_2_AIN              AM_MM32L373_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOD_2_INPUT_FLOAT      AM_MM32L373_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOD_2_INPUT_PD         AM_MM32L373_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOD_2_INPUT_PU         AM_MM32L373_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOD_2_OUT_PP           AM_MM32L373_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOD_2_OUT_OD           AM_MM32L373_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOD_2_AF_PP            AM_MM32L373_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOD_2_AF_OD            AM_MM32L373_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOD_2引脚响应速率
 * @{
 */

#define PIOD_2_SPEED_10MHz      AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 10MHz输出响应速率 */
#define PIOD_2_SPEED_2MHz       AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 20MHz输出响应速率 */
#define PIOD_2_SPEED_50MHz      AM_MM32L373_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * @}
 */

/**
 * @}if_mm32l373_pin
 */

#ifdef __cplusplus
}
#endif

#endif /* __MM32L373_PIN_H */

/* end of file */
